#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
google_bigquery_dataset.big_query: Refreshing state... [id=projects/dtc-dataops-dev-366316/datasets/trips_data_all]
google_service_account.airflow: Refreshing state... [id=projects/dtc-dataops-dev-366316/serviceAccounts/airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
module.nyc_taxi_data_lake.google_storage_bucket.gcp_bucket: Refreshing state... [id=nyc-taxi-dev-dtc-dataops-dev-366316]
google_project_iam_member.airflow["roles/bigquery.dataEditor"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/bigquery.dataEditor/serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
google_project_iam_member.airflow["roles/storage.objectAdmin"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/storage.objectAdmin/serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_bigquery_dataset.big_query has changed
  ~ resource "google_bigquery_dataset" "big_query" {
        id                              = "projects/dtc-dataops-dev-366316/datasets/trips_data_all"
      + labels                          = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # google_service_account.airflow has changed
  ~ resource "google_service_account" "airflow" {
        id           = "projects/dtc-dataops-dev-366316/serviceAccounts/airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
      + member       = "serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        name         = "projects/dtc-dataops-dev-366316/serviceAccounts/airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (6 unchanged attributes hidden)
    }

  # module.nyc_taxi_data_lake.google_storage_bucket.gcp_bucket has changed
  ~ resource "google_storage_bucket" "gcp_bucket" {
        id                          = "nyc-taxi-dev-dtc-dataops-dev-366316"
        name                        = "nyc-taxi-dev-dtc-dataops-dev-366316"
      + public_access_prevention    = "inherited"
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dtc_network.google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "cloud-composer-network-dev"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.dtc_network.google_compute_router.router will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "dtc-router-dev"
      + network            = (known after apply)
      + project            = "dtc-dataops-dev-366316"
      + region             = "us-west1"
      + self_link          = (known after apply)
    }

  # module.dtc_network.google_compute_router_nat.nat will be created
  + resource "google_compute_router_nat" "nat" {
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = true
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + name                                = "dtc-router-nat-dev"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + project                             = (known after apply)
      + region                              = "us-west1"
      + router                              = "dtc-router-dev"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30

      + log_config {
          + enable = true
          + filter = "ERRORS_ONLY"
        }
    }

  # module.dtc_network.google_compute_subnetwork.cloud_composer_subnet will be created
  + resource "google_compute_subnetwork" "cloud_composer_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.2.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "cloud-composer-subnet-dev"
      + network                    = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "us-west1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @djcurill, Action: `pull_request`*